{
  "en": {
    "aboutMe": {
      "data": {
        "aboutMe": {
          "languages": "Languages",
          "nationality": "Nationality"
        },
        "aboutMeValues": {
          "English": "English",
          "Spanish": "Spanish",
          "Argentina": "Argentinian"
        }
      },
      "description": "I am passionate about web development and video games, with a strong curiosity to learn new technologies. My focus is on creating engaging and functional digital experiences, combining my technical skills with creativity. I strive to continuously improve and add value to every project I work on.",
      "title": "About me"
    },
    "contact": {
      "description": "If you are looking for a dedicated frontend developer with diverse skills, let's get in touch!.",
      "title": "Let's work together",
      "input": {
        "button": "Send message",
        "email": "Email address",
        "lastname": "Last name",
        "message": "Type your message here",
        "name": "Name",
        "phone": "Phone number"
      },
      "feedback": {
        "success": "Your message has been sent successfully!",
        "error": "An error occurred while sending your message. Please try again later."
      }
    },
    "contactLabels": {
      "address": "Address",
      "email": "Email",
      "phone": "Phone"
    },
    "counters": {
      "yearsOfExperience": "Years of",
      "experience": "Experience",
      "projects": "Projects",
      "completed": "Completed",
      "technologies": "Technologies",
      "mastered": "Mastered",
      "commits": "Code",
      "commitsTitle": "Commits"
    },
    "education": {
      "button": "Education",
      "description": "I have pursued a variety of courses ranging from web development and frontend technologies, learned through institutions and online platforms like Coderhouse, Udemy, and YouTube. Additionally, I studied game programming at Da Vinci, where I acquired skills in game design, virtual reality, artificial intelligence, and more.",
      "title": "My education"
    },
    "experience": {
      "button": "Experience",
      "description": "I am a frontend developer at Interbanking, where I create effective and appealing web solutions. Previously, I worked in customer service, which allowed me to develop communication skills and a user-centered approach. My background includes numerous courses on technologies such as JavaScript, CSS3, React, and more.",
      "title": "My experience"
    },
    "home": {
      "description": "I'm a developer specialized in building attractive and functional user experiences for modern web applications. I'm passionate about creating intuitive interfaces using technologies like React and Chakra UI. One of my projects is this very portfolio.",
      "downloadCV": "Download CV",
      "subtitle": "Frontend Developer",
      "title": "Hi there! I'm"
    },
    "menu": {
      "home": "Home",
      "resume": "Resume",
      "work": "Work",
      "contact": "Contact me"
    },
    "projects": {
      "tooltip": {
        "github": "Github code",
        "livePage": "Live project"
      }
    },
    "resume": {
      "description": "I stand out for my ability to learn quickly, my passion for web development, and my commitment to delivering quality results. Additionally, my customer service skills allow me to communicate effectively and understand the needs of the end user.",
      "title": "Why hire me?"
    },
    "skills": {
      "button": "Skills",
      "description": "I am proficient in HTML, CSS3, JavaScript, and React, and I also have experience with Chakra UI, TypeScript, and the development of modern web applications. I have intermediate skills in graphic design with Photoshop and Illustrator.",
      "title": "My skills"
    },
    "validationErrors": {
      "email": {
        "invalid": "Please enter a valid email.",
        "consecutiveDots": "Email address cannot contain consecutive dots.",
        "invalidCharacters": "Email contains invalid characters."
      },
      "nameOrSurname": {
        "invalid": "Please enter a valid name or surname.",
        "length": "Name must be between 2 and 50 characters."
      },
      "phone": {
        "invalid": "Please enter a valid phone number.",
        "length": "Phone number must be between 3 and 15 digits."
      },
      "message": {
        "empty": "Message cannot be empty."
      }
    }
  },
  "es": {
    "aboutMe": {
      "data": {
        "aboutMe": {
          "languages": "Idiomas",
          "nationality": "Nacionalidad"
        },
        "aboutMeValues": {
          "English": "Inglés",
          "Spanish": "Español",
          "Argentina": "Argentino"
        }
      },
      "description": "Soy un apasionado del desarrollo web y de los videojuegos, con una gran curiosidad por aprender nuevas tecnologías. Mi enfoque es crear experiencias digitales atractivas y funcionales, combinando mis habilidades técnicas con mi creatividad. Me esfuerzo constantemente por mejorar y aportar valor a cada proyecto en el que trabajo.",
      "title": "Sobre mí"
    },
    "contact": {
      "description": "Si estás buscando un desarrollador frontend dedicado y con habilidades diversas, pongamonos en contacto!.",
      "title": "Trabajemos juntos",
      "input": {
        "button": "Enviar mensaje",
        "email": "Dirección de correo",
        "lastname": "Apellido",
        "message": "Escriba su mensaje aquí",
        "name": "Nombre",
        "phone": "Número de teléfono"
      },
      "feedback": {
        "success": "¡Tu mensaje ha sido enviado con éxito!",
        "error": "Ocurrió un error al enviar tu mensaje. Por favor, inténtalo de nuevo más tarde."
      }
    },
    "contactLabels": {
      "address": "Dirección",
      "email": "Email",
      "phone": "Teléfono"
    },
    "counters": {
      "yearsOfExperience": "Años de",
      "experience": "Experiencia",
      "projects": "Proyectos",
      "completed": "Completados",
      "technologies": "Tecnologías",
      "mastered": "Dominadas",
      "commits": "Código",
      "commitsTitle": "Commits"
    },
    "education": {
      "button": "Educación",
      "description": "He seguido una variedad de cursos que abarcan desde desarrollo web y tecnologías frontend, aprendidos a través de instituciones y plataformas en línea como Coderhouse, Udemy, YouTube. Además, estudié programación de videojuegos en Da Vinci, donde adquirí habilidades en diseño de juegos, realidad virtual, inteligencia artificial, y más.",
      "title": "Mi educación"
    },
    "experience": {
      "button": "Experiencia",
      "description": "Soy desarrollador frontend en Interbanking, donde creo soluciones web efectivas y atractivas. Antes, trabajé en atención al cliente, lo que me permitió desarrollar habilidades comunicativas y un enfoque centrado en el usuario. Mi trayectoria incluye numerosos cursos sobre tecnologías como Javascript, CSS3, React, y más.",
      "title": "Mi experiencia"
    },
    "home": {
      "description": "Soy un desarrollador especializado en construir experiencias de usuario atractivas y funcionales para aplicaciones web modernas. Me apasiona crear interfaces intuitivas utilizando tecnologías como React y Chakra UI. Uno de mis proyectos es este mismo portfolio.",
      "downloadCV": "Descargar CV",
      "subtitle": "Desarrollador Frontend",
      "title": "¡Hola! Soy"
    },
    "menu": {
      "home": "Inicio",
      "resume": "Currículum",
      "work": "Trabajos",
      "contact": "Contáctame"
    },
    "projects": {
      "tooltip": {
        "github": "Código en Github",
        "livePage": "Proyecto en vivo"
      }
    },
    "resume": {
      "description": "Me destaco por mi capacidad para aprender rápidamente, mi pasión por el desarrollo web, ofrezco soluciones innovadoras y estoy comprometido con entregar resultados de calidad. Además, mis habilidades en atención al cliente me permiten comunicarme eficazmente y entender las necesidades del usuario final.",
      "title": "¿Por qué contratarme?"
    },
    "skills": {
      "button": "Habilidades",
      "description": "Soy competente en HTML, CSS3, JavaScript, y React, y también tengo experiencia con Chakra UI, TypeScript, y el desarrollo de aplicaciones web modernas. Además, tengo habilidades intermedias en diseño gráfico con Photoshop e Illustrator.",
      "title": "Mis habilidades"
    },
    "validationErrors": {
      "email": {
        "invalid": "Ingrese un email válido.",
        "consecutiveDots": "La dirección de correo no puede contener puntos consecutivos.",
        "invalidCharacters": "El correo contiene caracteres inválidos."
      },
      "nameOrSurname": {
        "invalid": "Ingrese un nombre o apellido válido.",
        "length": "El nombre debe tener entre 2 y 50 caracteres."
      },
      "phone": {
        "invalid": "Ingrese un número de teléfono válido.",
        "length": "El número de teléfono debe tener entre 3 y 15 dígitos."
      },
      "message": {
        "empty": "El mensaje no puede estar vacío."
      }
    }
  }
}
